Revit 2026 API

# FaceToposolidCreate Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FaceToposolid Create(
	Document document,
	ElementId toposolidTypeId,
	ElementId levelId,
	IList<Reference> faceReferences
)
```
```vb
Public Shared Function Create (
	document As Document,
	toposolidTypeId As ElementId,
	levelId As ElementId,
	faceReferences As IList(Of Reference)
) As FaceToposolid
```
```cpp
public:
static FaceToposolid^ Create(
	Document^ document,
	ElementId^ toposolidTypeId,
	ElementId^ levelId,
	IList<Reference^>^ faceReferences
)
```
```fsharp
static member Create :
        document : Document *
        toposolidTypeId : ElementId *
        levelId : ElementId *
        faceReferences : IList<Reference> -> FaceToposolid
```

#### Parameters

document Document

toposolidTypeId ElementId

levelId ElementId

faceReferences IListReference

#### Return Value

FaceToposolid

#### Reference

FaceToposolid Class

Autodesk.Revit.DB Namespace